[Killed] ArrowFunction
main/pages/RecommendationRequest/RecommendationRequestCreatePage.js:9:31
 import { toast } from "react-toastify";
 
 export default function RecommendationRequestCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (recommendationRequest) => ({
-    url: "/api/RecommendationRequest/post",
-    method: "POST",
-    params: {
-      requesterEmail: recommendationRequest.requesterEmail,
-      professorEmail: recommendationRequest.professorEmail,
-      explanation: recommendationRequest.explanation,
-      dateRequested: recommendationRequest.dateRequested,
-      dateNeeded: recommendationRequest.dateNeeded,
-      done: recommendationRequest.done,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (recommendationRequest) => {
killedBy: RecommendationRequestCreatePage tests form submit calls POST with correct data
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
main/pages/RecommendationRequest/RecommendationRequestCreatePage.js:10:10
 
 export default function RecommendationRequestCreatePage({ storybook = false }) {
   const objectToAxiosParams = (recommendationRequest) => ({
-    url: "/api/RecommendationRequest/post",
+    url: "",
     method: "POST",
     params: {
killedBy: RecommendationRequestCreatePage tests success message is shown and user is redirected to recommendationrequest
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "New RecommendationRequest Created - id: 7 requesterEmail: student1@ucsb.edu",

[Killed] BlockStatement
main/pages/RecommendationRequest/RecommendationRequestCreatePage.js:41:32
     mutation.mutate(data);
   };
 
-  if (isSuccess && !storybook) {
-    return React.createElement(Navigate, { to: "/recommendationrequest" });
-  }
+  if (isSuccess && !storybook) {}
 
   return React.createElement(
killedBy: RecommendationRequestCreatePage tests success message is shown and user is redirected to recommendationrequest
statusReason: expected "vi.fn()" to be called with arguments: [ { to: '/recommendationrequest' } ]

Number of calls: 0

[Killed] StringLiteral
main/pages/RecommendationRequest/RecommendationRequestCreatePage.js:49:7
     BasicLayout,
     null,
     React.createElement(
-      "div",
+      "",
       { className: "pt-2" },
       React.createElement("h1", null, "Create New RecommendationRequest"),
killedBy: RecommendationRequestCreatePage tests page renders
statusReason: "" did not match the Name production

[Killed] StringLiteral
main/pages/RecommendationRequest/RecommendationRequestCreatePage.js:51:39
     React.createElement(
       "div",
       { className: "pt-2" },
-      React.createElement("h1", null, "Create New RecommendationRequest"),
+      React.createElement("h1", null, ""),
       React.createElement(RecommendationRequestForm, {
         submitAction: onSubmit,
killedBy: RecommendationRequestCreatePage tests page renders
statusReason: Unable to find an element with the text: Create New RecommendationRequest. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
