[Killed] BlockStatement
main/pages/RecommendationRequest/RecommendationRequestEditPage.js:4:57
 import React from "react";
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-export default function RecommendationRequestEditPage() {
-  // Stryker disable all : placeholder for future implementation
-  return React.createElement(
-    BasicLayout,
-    null,
-    React.createElement(
-      "div",
-      { className: "pt-2" },
-      React.createElement("h1", null, "Edit page not yet implemented"),
-    ),
-  );
-}
+export default function RecommendationRequestEditPage() {}
 
killedBy: RecommendationRequestEditPage tests renders expected content
statusReason: Unable to find an element with the text: Edit page not yet implemented. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style
