[Killed] ArrowFunction
main/components/RecommendationRequest/RecommendationRequestForm.js:23:20
   const testIdPrefix = "RecommendationRequestForm";
   const h = React.createElement;
 
-  const feedback = (message) =>
-    h(Form.Control.Feedback, { type: "invalid" }, message);
+  const feedback = () => undefined;
 
   const idField =
killedBy: RecommendationRequestCreatePage tests invalid form data is not submitted
statusReason: Unable to find an element with the text: Requester Email is required.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:24:38
   const h = React.createElement;
 
   const feedback = (message) =>
-    h(Form.Control.Feedback, { type: "invalid" }, message);
+    h(Form.Control.Feedback, { type: "" }, message);
 
   const idField =
killedBy: RecommendationRequestForm tests shows validation messages for missing required fields
statusReason: expect(element).toHaveClass("invalid-feedback")

Expected the element to have class:
  invalid-feedback
Received:
  -feedback

[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:24:30
   const h = React.createElement;
 
   const feedback = (message) =>
-    h(Form.Control.Feedback, { type: "invalid" }, message);
+    h(Form.Control.Feedback, {}, message);
 
   const idField =
killedBy: RecommendationRequestForm tests shows validation messages for missing required fields
statusReason: expect(element).toHaveClass("invalid-feedback")

Expected the element to have class:
  invalid-feedback
Received:
  valid-feedback

[Killed] LogicalOperator
main/components/RecommendationRequest/RecommendationRequestForm.js:27:5
     h(Form.Control.Feedback, { type: "invalid" }, message);
 
   const idField =
-    initialContents &&
-    h(
-      Col,
-      null,
-      h(
-        Form.Group,
-        { className: "mb-3" },
-        h(Form.Label, { htmlFor: "id" }, "Id"),
-        h(Form.Control, {
-          "data-testid": testIdPrefix + "-id",
-          id: "id",
-          type: "text",
-          ...register("id"),
-          value: initialContents.id,
-          readOnly: true,
-        }),
-      ),
-    );
+    initialContents || h(Col, null, h(Form.Group, {
+  className: "mb-3"
+}, h(Form.Label, {
+  htmlFor: "id"
+}, "Id"), h(Form.Control, {
+  "data-testid": testIdPrefix + "-id",
+  id: "id",
+  type: "text",
+  ...register("id"),
+  value: initialContents.id,
+  readOnly: true
+})));
 
   return h(
killedBy: RecommendationRequestForm tests renders correctly with no initialContents
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.js:27:5
     h(Form.Control.Feedback, { type: "invalid" }, message);
 
   const idField =
-    initialContents &&
-    h(
-      Col,
-      null,
-      h(
-        Form.Group,
-        { className: "mb-3" },
-        h(Form.Label, { htmlFor: "id" }, "Id"),
-        h(Form.Control, {
-          "data-testid": testIdPrefix + "-id",
-          id: "id",
-          type: "text",
-          ...register("id"),
-          value: initialContents.id,
-          readOnly: true,
-        }),
-      ),
-    );
+    true;
 
   return h(
killedBy: RecommendationRequestForm tests edit mode shows id as read-only and prepopulates fields
statusReason: Unable to find an element by: [data-testid="RecommendationRequestForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:33:22
       null,
       h(
         Form.Group,
-        { className: "mb-3" },
+        { className: "" },
         h(Form.Label, { htmlFor: "id" }, "Id"),
         h(Form.Control, {
killedBy: RecommendationRequestForm tests form controls are laid out with bootstrap spacing classes
statusReason: expect(received).toHaveClass()

received value must be an HTMLElement or an SVGElement.
Received has type:  Null
Received has value: null

[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:34:23
       h(
         Form.Group,
         { className: "mb-3" },
-        h(Form.Label, { htmlFor: "id" }, "Id"),
+        h(Form.Label, {}, "Id"),
         h(Form.Control, {
           "data-testid": testIdPrefix + "-id",
killedBy: RecommendationRequestForm tests edit mode shows id as read-only and prepopulates fields
statusReason: Found a label with the text of: Id, however no form control was found associated to that label. Make sure you're using the "for" attribute or "aria-labelledby" attribute correctly.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:34:34
       h(
         Form.Group,
         { className: "mb-3" },
-        h(Form.Label, { htmlFor: "id" }, "Id"),
+        h(Form.Label, { htmlFor: "" }, "Id"),
         h(Form.Control, {
           "data-testid": testIdPrefix + "-id",
killedBy: RecommendationRequestForm tests edit mode shows id as read-only and prepopulates fields
statusReason: Found a label with the text of: Id, however no form control was found associated to that label. Make sure you're using the "for" attribute or "aria-labelledby" attribute correctly.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:38:17
         h(Form.Control, {
           "data-testid": testIdPrefix + "-id",
           id: "id",
-          type: "text",
+          type: "",
           ...register("id"),
           value: initialContents.id,
killedBy: RecommendationRequestForm tests edit mode shows id as read-only and prepopulates fields
statusReason: expect(element).toHaveAttribute("type", "text") // element.getAttribute("type") === "text"

Expected the element to have attribute:
  type="text"
Received:
  type=""

[Killed] BooleanLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:41:21
           type: "text",
           ...register("id"),
           value: initialContents.id,
-          readOnly: true,
+          readOnly: false,
         }),
       ),
killedBy: RecommendationRequestForm tests edit mode shows id as read-only and prepopulates fields
statusReason: expect(element).toHaveAttribute("readonly") // element.hasAttribute("readonly")

Expected the element to have attribute:
  readonly
Received:
  null

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:59:56
         h(
           Form.Group,
           { className: "mb-3" },
-          h(Form.Label, { htmlFor: "requesterEmail" }, "Requester Email"),
+          h(Form.Label, { htmlFor: "requesterEmail" }, ""),
           h(Form.Control, {
             "data-testid": testIdPrefix + "-requesterEmail",
killedBy: RecommendationRequestForm tests renders correctly with no initialContents
statusReason: Unable to find an element with the text: /Requester Email/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:61:43
           { className: "mb-3" },
           h(Form.Label, { htmlFor: "requesterEmail" }, "Requester Email"),
           h(Form.Control, {
-            "data-testid": testIdPrefix + "-requesterEmail",
+            "data-testid": testIdPrefix + "",
             id: "requesterEmail",
             type: "email",
killedBy: RecommendationRequestForm tests edit mode shows id as read-only and prepopulates fields
statusReason: Unable to find an element by: [data-testid="RecommendationRequestForm-requesterEmail"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:62:17
           h(Form.Label, { htmlFor: "requesterEmail" }, "Requester Email"),
           h(Form.Control, {
             "data-testid": testIdPrefix + "-requesterEmail",
-            id: "requesterEmail",
+            id: "",
             type: "email",
             isInvalid: Boolean(errors.requesterEmail),
killedBy: RecommendationRequestForm tests uses accessible labels and expected input attributes
statusReason: Found a label with the text of: Requester Email, however no form control was found associated to that label. Make sure you're using the "for" attribute or "aria-labelledby" attribute correctly.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] OptionalChaining
main/components/RecommendationRequest/RecommendationRequestForm.js:69:20
               required: "Requester Email is required.",
             }),
           }),
-          feedback(errors.requesterEmail?.message),
+          feedback(errors.requesterEmail.message),
         ),
       ),
killedBy: RecommendationRequestForm tests renders correctly with no initialContents
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:77:11
         null,
         h(
           Form.Group,
-          { className: "mb-3" },
+          {},
           h(Form.Label, { htmlFor: "professorEmail" }, "Professor Email"),
           h(Form.Control, {
killedBy: RecommendationRequestForm tests form controls are laid out with bootstrap spacing classes
statusReason: expect(received).toHaveClass()

received value must be an HTMLElement or an SVGElement.
Received has type:  Null
Received has value: null

[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:78:25
         h(
           Form.Group,
           { className: "mb-3" },
-          h(Form.Label, { htmlFor: "professorEmail" }, "Professor Email"),
+          h(Form.Label, {}, "Professor Email"),
           h(Form.Control, {
             "data-testid": testIdPrefix + "-professorEmail",
killedBy: RecommendationRequestForm tests uses accessible labels and expected input attributes
statusReason: Found a label with the text of: Professor Email, however no form control was found associated to that label. Make sure you're using the "for" attribute or "aria-labelledby" attribute correctly.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:78:56
         h(
           Form.Group,
           { className: "mb-3" },
-          h(Form.Label, { htmlFor: "professorEmail" }, "Professor Email"),
+          h(Form.Label, { htmlFor: "professorEmail" }, ""),
           h(Form.Control, {
             "data-testid": testIdPrefix + "-professorEmail",
killedBy: RecommendationRequestForm tests renders correctly with no initialContents
statusReason: Unable to find an element with the text: /Professor Email/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:81:17
           h(Form.Label, { htmlFor: "professorEmail" }, "Professor Email"),
           h(Form.Control, {
             "data-testid": testIdPrefix + "-professorEmail",
-            id: "professorEmail",
+            id: "",
             type: "email",
             isInvalid: Boolean(errors.professorEmail),
killedBy: RecommendationRequestForm tests uses accessible labels and expected input attributes
statusReason: Found a label with the text of: Professor Email, however no form control was found associated to that label. Make sure you're using the "for" attribute or "aria-labelledby" attribute correctly.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:82:19
           h(Form.Control, {
             "data-testid": testIdPrefix + "-professorEmail",
             id: "professorEmail",
-            type: "email",
+            type: "",
             isInvalid: Boolean(errors.professorEmail),
             ...register("professorEmail", {
killedBy: RecommendationRequestForm tests uses accessible labels and expected input attributes
statusReason: expect(element).toHaveAttribute("type", "email") // element.getAttribute("type") === "email"

Expected the element to have attribute:
  type="email"
Received:
  type=""

[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:84:43
             id: "professorEmail",
             type: "email",
             isInvalid: Boolean(errors.professorEmail),
-            ...register("professorEmail", {
-              required: "Professor Email is required.",
-            }),
+            ...register("professorEmail", {}),
           }),
           feedback(errors.professorEmail?.message),
killedBy: RecommendationRequestForm tests shows validation messages for missing required fields
statusReason: Unable to find an element with the text: /Professor Email is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] OptionalChaining
main/components/RecommendationRequest/RecommendationRequestForm.js:88:20
               required: "Professor Email is required.",
             }),
           }),
-          feedback(errors.professorEmail?.message),
+          feedback(errors.professorEmail.message),
         ),
       ),
killedBy: RecommendationRequestForm tests renders correctly with no initialContents
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] OptionalChaining
main/components/RecommendationRequest/RecommendationRequestForm.js:112:20
               required: "Explanation is required.",
             }),
           }),
-          feedback(errors.explanation?.message),
+          feedback(errors.explanation.message),
         ),
       ),
killedBy: RecommendationRequestForm tests renders correctly with no initialContents
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:125:25
         h(
           Form.Group,
           { className: "mb-3" },
-          h(Form.Label, { htmlFor: "dateRequested" }, "Date Requested"),
+          h(Form.Label, {}, "Date Requested"),
           h(Form.Control, {
             "data-testid": testIdPrefix + "-dateRequested",
killedBy: RecommendationRequestForm tests uses accessible labels and expected input attributes
statusReason: Found a label with the text of: Date Requested, however no form control was found associated to that label. Make sure you're using the "for" attribute or "aria-labelledby" attribute correctly.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:125:36
         h(
           Form.Group,
           { className: "mb-3" },
-          h(Form.Label, { htmlFor: "dateRequested" }, "Date Requested"),
+          h(Form.Label, { htmlFor: "" }, "Date Requested"),
           h(Form.Control, {
             "data-testid": testIdPrefix + "-dateRequested",
killedBy: RecommendationRequestForm tests uses accessible labels and expected input attributes
statusReason: Found a label with the text of: Date Requested, however no form control was found associated to that label. Make sure you're using the "for" attribute or "aria-labelledby" attribute correctly.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:131:25
             id: "dateRequested",
             type: "datetime-local",
             isInvalid: Boolean(errors.dateRequested),
-            ...register("dateRequested", {
+            ...register("", {
               required: "Date Requested is required.",
             }),
killedBy: RecommendationRequestForm tests renders correctly with no initialContents
statusReason: Cannot read properties of undefined (reading '_f')

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:132:25
             type: "datetime-local",
             isInvalid: Boolean(errors.dateRequested),
             ...register("dateRequested", {
-              required: "Date Requested is required.",
+              required: "",
             }),
           }),
killedBy: RecommendationRequestForm tests shows validation messages for missing required fields
statusReason: Unable to find an element with the text: /Date Requested is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] OptionalChaining
main/components/RecommendationRequest/RecommendationRequestForm.js:135:20
               required: "Date Requested is required.",
             }),
           }),
-          feedback(errors.dateRequested?.message),
+          feedback(errors.dateRequested.message),
         ),
       ),
killedBy: RecommendationRequestForm tests renders correctly with no initialContents
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:144:36
         h(
           Form.Group,
           { className: "mb-3" },
-          h(Form.Label, { htmlFor: "dateNeeded" }, "Date Needed"),
+          h(Form.Label, { htmlFor: "" }, "Date Needed"),
           h(Form.Control, {
             "data-testid": testIdPrefix + "-dateNeeded",
killedBy: RecommendationRequestForm tests uses accessible labels and expected input attributes
statusReason: Found a label with the text of: Date Needed, however no form control was found associated to that label. Make sure you're using the "for" attribute or "aria-labelledby" attribute correctly.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:145:27
           Form.Group,
           { className: "mb-3" },
           h(Form.Label, { htmlFor: "dateNeeded" }, "Date Needed"),
-          h(Form.Control, {
-            "data-testid": testIdPrefix + "-dateNeeded",
-            id: "dateNeeded",
-            type: "datetime-local",
-            isInvalid: Boolean(errors.dateNeeded),
-            ...register("dateNeeded", {
-              required: "Date Needed is required.",
-            }),
-          }),
+          h(Form.Control, {}),
           feedback(errors.dateNeeded?.message),
         ),
killedBy: RecommendationRequestForm tests edit mode shows id as read-only and prepopulates fields
statusReason: Unable to find an element by: [data-testid="RecommendationRequestForm-dateNeeded"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:148:19
           h(Form.Control, {
             "data-testid": testIdPrefix + "-dateNeeded",
             id: "dateNeeded",
-            type: "datetime-local",
+            type: "",
             isInvalid: Boolean(errors.dateNeeded),
             ...register("dateNeeded", {
killedBy: RecommendationRequestForm tests edit mode shows id as read-only and prepopulates fields
statusReason: expect(element).toHaveValue(2026-05-01T17:00)

Expected the element to have value:
  2026-05-01T17:00
Received:
  2026-05-01T17:00:00

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:150:25
             id: "dateNeeded",
             type: "datetime-local",
             isInvalid: Boolean(errors.dateNeeded),
-            ...register("dateNeeded", {
+            ...register("", {
               required: "Date Needed is required.",
             }),
killedBy: RecommendationRequestForm tests renders correctly with no initialContents
statusReason: Cannot read properties of undefined (reading '_f')

[Killed] OptionalChaining
main/components/RecommendationRequest/RecommendationRequestForm.js:154:20
               required: "Date Needed is required.",
             }),
           }),
-          feedback(errors.dateNeeded?.message),
+          feedback(errors.dateNeeded.message),
         ),
       ),
killedBy: RecommendationRequestForm tests renders correctly with no initialContents
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:169:17
           { className: "mb-3" },
           h(Form.Check, {
             "data-testid": testIdPrefix + "-done",
-            id: "done",
+            id: "",
             label: "Done",
             type: "checkbox",
killedBy: RecommendationRequestForm tests uses accessible labels and expected input attributes
statusReason: Found a label with the text of: Done, however no form control was found associated to that label. Make sure you're using the "for" attribute or "aria-labelledby" attribute correctly.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:185:19
         null,
         h(
           Button,
-          { type: "submit", "data-testid": testIdPrefix + "-submit" },
+          { type: "", "data-testid": testIdPrefix + "-submit" },
           buttonLabel,
         ),
killedBy: RecommendationRequestForm tests uses accessible labels and expected input attributes
statusReason: expect(element).toHaveAttribute("type", "submit") // element.getAttribute("type") === "submit"

Expected the element to have attribute:
  type="submit"
Received:
  type=""

[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:190:11
         ),
         h(
           Button,
-          {
-            variant: "secondary",
-            onClick: () => navigate(-1),
-            "data-testid": testIdPrefix + "-cancel",
-          },
+          {},
           "Cancel",
         ),
killedBy: RecommendationRequestForm tests renders correctly with no initialContents
statusReason: Unable to find an element by: [data-testid="RecommendationRequestForm-cancel"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] UnaryOperator
main/components/RecommendationRequest/RecommendationRequestForm.js:192:37
           Button,
           {
             variant: "secondary",
-            onClick: () => navigate(-1),
+            onClick: () => navigate(+1),
             "data-testid": testIdPrefix + "-cancel",
           },
killedBy: RecommendationRequestForm tests that the Cancel button navigates back
statusReason: expected "vi.fn()" to be called with arguments: [ -1 ]

Received: 

  1st vi.fn() call:

  [
-   -1,

[Killed] ArrowFunction
main/components/RecommendationRequest/RecommendationRequestForm.js:192:22
           Button,
           {
             variant: "secondary",
-            onClick: () => navigate(-1),
+            onClick: () => undefined,
             "data-testid": testIdPrefix + "-cancel",
           },
killedBy: RecommendationRequestForm tests that the Cancel button navigates back
statusReason: expected "vi.fn()" to be called with arguments: [ -1 ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:195:11
             onClick: () => navigate(-1),
             "data-testid": testIdPrefix + "-cancel",
           },
-          "Cancel",
+          "",
         ),
       ),
killedBy: RecommendationRequestForm tests renders correctly with no initialContents
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Cancel
Received:
