[Killed] ArrowFunction
main/components/RecommendationRequest/RecommendationRequestTable.js:19:35
     navigate(`/recommendationrequest/edit/${cell.row.original.id}`);
   };
 
-  const cellToAxiosParamsDelete = (cell) => ({
-    url: "/api/RecommendationRequest",
-    method: "DELETE",
-    params: {
-      id: cell.row.original.id,
-    },
-  });
+  const cellToAxiosParamsDelete = () => undefined;
 
   const onDeleteSuccess = (message) => {
killedBy: RecommendationRequestIndexPage tests admin can delete recommendation request
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "RecommendationRequest with id 1 was deleted",

[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:19:46
     navigate(`/recommendationrequest/edit/${cell.row.original.id}`);
   };
 
-  const cellToAxiosParamsDelete = (cell) => ({
-    url: "/api/RecommendationRequest",
-    method: "DELETE",
-    params: {
-      id: cell.row.original.id,
-    },
-  });
+  const cellToAxiosParamsDelete = (cell) => ({});
 
   const onDeleteSuccess = (message) => {
killedBy: RecommendationRequestIndexPage tests admin can delete recommendation request
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "RecommendationRequest with id 1 was deleted",

[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:82:40
     );
   }
 
-  return React.createElement(OurTable, {
-    data: recommendationRequests,
-    columns,
-    testid: testIdPrefix,
-  });
+  return React.createElement(OurTable, {});
 }
 
killedBy: RecommendationRequestTable tests renders empty table correctly
statusReason: Cannot read properties of undefined (reading 'map')
