[Killed] BlockStatement
main/pages/RecommendationRequest/RecommendationRequestIndexPage.js:23:30
     [],
   );
 
-  const createButton = () => {
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
-      return React.createElement(
-        Button,
-        {
-          variant: "primary",
-          href: "/recommendationrequest/create",
-          style: { float: "right" },
-        },
-        "Create RecommendationRequest",
-      );
-    }
-  };
+  const createButton = () => {};
 
   return React.createElement(
killedBy: RecommendationRequestIndexPage tests renders with Create button for admin user
statusReason: Unable to find an element with the text: Create RecommendationRequest. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
main/pages/RecommendationRequest/RecommendationRequestIndexPage.js:24:45
   );
 
   const createButton = () => {
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
-      return React.createElement(
-        Button,
-        {
-          variant: "primary",
-          href: "/recommendationrequest/create",
-          style: { float: "right" },
-        },
-        "Create RecommendationRequest",
-      );
-    }
+    if (hasRole(currentUser, "ROLE_ADMIN")) {}
   };
 
killedBy: RecommendationRequestIndexPage tests renders with Create button for admin user
statusReason: Unable to find an element with the text: Create RecommendationRequest. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/pages/RecommendationRequest/RecommendationRequestIndexPage.js:28:20
       return React.createElement(
         Button,
         {
-          variant: "primary",
+          variant: "",
           href: "/recommendationrequest/create",
           style: { float: "right" },
killedBy: RecommendationRequestIndexPage tests renders with Create button for admin user
statusReason: expect(element).toHaveClass("btn-primary")

Expected the element to have class:
  btn-primary
Received:
  btn

[Killed] StringLiteral
main/pages/RecommendationRequest/RecommendationRequestIndexPage.js:30:27
         {
           variant: "primary",
           href: "/recommendationrequest/create",
-          style: { float: "right" },
+          style: { float: "" },
         },
         "Create RecommendationRequest",
killedBy: RecommendationRequestIndexPage tests renders with Create button for admin user
statusReason: expect(element).toHaveAttribute("style", "float: right;") // element.getAttribute("style") === "float: right;"

Expected the element to have attribute:
  style="float: right;"
Received:
  null

[Killed] ObjectLiteral
main/pages/RecommendationRequest/RecommendationRequestIndexPage.js:42:7
     null,
     React.createElement(
       "div",
-      { className: "pt-2" },
+      {},
       createButton(),
       React.createElement("h1", null, "RecommendationRequests"),
killedBy: RecommendationRequestIndexPage tests renders with Create button for admin user
statusReason: expect(received).toHaveClass()

received value must be an HTMLElement or an SVGElement.
Received has type:  Null
Received has value: null

[Killed] StringLiteral
main/pages/RecommendationRequest/RecommendationRequestIndexPage.js:44:39
       "div",
       { className: "pt-2" },
       createButton(),
-      React.createElement("h1", null, "RecommendationRequests"),
+      React.createElement("h1", null, ""),
       React.createElement(RecommendationRequestTable, {
         recommendationRequests,
killedBy: RecommendationRequestIndexPage tests renders with Create button for admin user
statusReason: Unable to find an element with the text: RecommendationRequests. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ObjectLiteral
main/pages/RecommendationRequest/RecommendationRequestIndexPage.js:45:55
       { className: "pt-2" },
       createButton(),
       React.createElement("h1", null, "RecommendationRequests"),
-      React.createElement(RecommendationRequestTable, {
-        recommendationRequests,
-        currentUser,
-      }),
+      React.createElement(RecommendationRequestTable, {}),
     ),
   );
killedBy: RecommendationRequestIndexPage tests renders with Create button for admin user
statusReason: Cannot read properties of undefined (reading 'length')
