[Killed] ObjectLiteral
src/main/fixtures/recommendationRequestFixtures.js:2:29
 const recommendationRequestFixtures = {
-  oneRecommendationRequest: {
-    id: 1,
-    requesterEmail: "student1@ucsb.edu",
-    professorEmail: "professor1@ucsb.edu",
-    explanation: "Request for a graduate school recommendation letter",
-    dateRequested: "2026-04-20T10:15:30",
-    dateNeeded: "2026-05-01T17:00:00",
-    done: false,
-  },
+  oneRecommendationRequest: {},
 
   threeRecommendationRequests: [
killedBy: recommendationRequestFixtures tests fixtures have the expected contents
statusReason: expected { oneRecommendationRequest: {}, …(1) } to deeply equal { …(2) }

[Killed] StringLiteral
src/main/fixtures/recommendationRequestFixtures.js:8:17
     professorEmail: "professor1@ucsb.edu",
     explanation: "Request for a graduate school recommendation letter",
     dateRequested: "2026-04-20T10:15:30",
-    dateNeeded: "2026-05-01T17:00:00",
+    dateNeeded: "",
     done: false,
   },
killedBy: recommendationRequestFixtures tests fixtures have the expected contents
statusReason: expected { …(2) } to deeply equal { …(2) }

[Killed] BooleanLiteral
src/main/fixtures/recommendationRequestFixtures.js:9:11
     explanation: "Request for a graduate school recommendation letter",
     dateRequested: "2026-04-20T10:15:30",
     dateNeeded: "2026-05-01T17:00:00",
-    done: false,
+    done: true,
   },
 
killedBy: recommendationRequestFixtures tests fixtures have the expected contents
statusReason: expected { …(2) } to deeply equal { …(2) }

[Killed] StringLiteral
src/main/fixtures/recommendationRequestFixtures.js:15:23
   threeRecommendationRequests: [
     {
       id: 1,
-      requesterEmail: "student1@ucsb.edu",
+      requesterEmail: "",
       professorEmail: "professor1@ucsb.edu",
       explanation: "Request for a graduate school recommendation letter",
killedBy: recommendationRequestFixtures tests fixtures have the expected contents
statusReason: expected { …(2) } to deeply equal { …(2) }

[Killed] StringLiteral
src/main/fixtures/recommendationRequestFixtures.js:18:22
       requesterEmail: "student1@ucsb.edu",
       professorEmail: "professor1@ucsb.edu",
       explanation: "Request for a graduate school recommendation letter",
-      dateRequested: "2026-04-20T10:15:30",
+      dateRequested: "",
       dateNeeded: "2026-05-01T17:00:00",
       done: false,
killedBy: recommendationRequestFixtures tests fixtures have the expected contents
statusReason: expected { …(2) } to deeply equal { …(2) }

[Killed] ObjectLiteral
src/main/fixtures/recommendationRequestFixtures.js:22:5
       dateNeeded: "2026-05-01T17:00:00",
       done: false,
     },
-    {
-      id: 2,
-      requesterEmail: "student2@ucsb.edu",
-      professorEmail: "professor2@ucsb.edu",
-      explanation: "Recommendation needed for a summer research internship",
-      dateRequested: "2026-04-22T09:30:00",
-      dateNeeded: "2026-05-08T12:00:00",
-      done: true,
-    },
+    {},
     {
       id: 3,
killedBy: recommendationRequestFixtures tests fixtures have the expected contents
statusReason: expected { …(2) } to deeply equal { …(2) }

[Killed] StringLiteral
src/main/fixtures/recommendationRequestFixtures.js:25:23
     {
       id: 2,
       requesterEmail: "student2@ucsb.edu",
-      professorEmail: "professor2@ucsb.edu",
+      professorEmail: "",
       explanation: "Recommendation needed for a summer research internship",
       dateRequested: "2026-04-22T09:30:00",
killedBy: recommendationRequestFixtures tests fixtures have the expected contents
statusReason: expected { …(2) } to deeply equal { …(2) }

[Killed] BooleanLiteral
src/main/fixtures/recommendationRequestFixtures.js:29:13
       explanation: "Recommendation needed for a summer research internship",
       dateRequested: "2026-04-22T09:30:00",
       dateNeeded: "2026-05-08T12:00:00",
-      done: true,
+      done: false,
     },
     {
killedBy: recommendationRequestFixtures tests fixtures have the expected contents
statusReason: expected { …(2) } to deeply equal { …(2) }

[Killed] ObjectLiteral
src/main/fixtures/recommendationRequestFixtures.js:31:5
       dateNeeded: "2026-05-08T12:00:00",
       done: true,
     },
-    {
-      id: 3,
-      requesterEmail: "student3@ucsb.edu",
-      professorEmail: "professor3@ucsb.edu",
-      explanation: "Letter request for a scholarship application",
-      dateRequested: "2026-04-25T14:45:00",
-      dateNeeded: "2026-05-15T23:59:00",
-      done: false,
-    },
+    {},
   ],
 };
killedBy: recommendationRequestFixtures tests fixtures have the expected contents
statusReason: expected { …(2) } to deeply equal { …(2) }

[Killed] BooleanLiteral
src/main/fixtures/recommendationRequestFixtures.js:38:13
       explanation: "Letter request for a scholarship application",
       dateRequested: "2026-04-25T14:45:00",
       dateNeeded: "2026-05-15T23:59:00",
-      done: false,
+      done: true,
     },
   ],
killedBy: recommendationRequestFixtures tests fixtures have the expected contents
statusReason: expected { …(2) } to deeply equal { …(2) }
