[Killed] StringLiteral
main/pages/RecommendationRequest/RecommendationRequestEditPage.js:21:12
     {
       // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
       method: "GET",
-      url: "/api/RecommendationRequest",
+      url: "",
       params: {
         id,
killedBy: RecommendationRequestEditPage tests loads existing record by id and populates form
statusReason: Unable to find an element by: [data-testid="RecommendationRequestForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrowFunction
main/pages/RecommendationRequest/RecommendationRequestEditPage.js:28:34
     },
   );
 
-  const objectToAxiosPutParams = (recommendationRequest) => ({
-    url: "/api/RecommendationRequest",
-    method: "PUT",
-    params: {
-      id: recommendationRequest.id,
-    },
-    data: {
-      requesterEmail: recommendationRequest.requesterEmail,
-      professorEmail: recommendationRequest.professorEmail,
-      explanation: recommendationRequest.explanation,
-      dateRequested: recommendationRequest.dateRequested,
-      dateNeeded: recommendationRequest.dateNeeded,
-      done: recommendationRequest.done,
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (recommendationRequest) => {
killedBy: RecommendationRequestEditPage tests submit valid changes with PUT and redirects
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ObjectLiteral
main/pages/RecommendationRequest/RecommendationRequestEditPage.js:64:42
   };
 
   if (isSuccess && !storybook) {
-    return React.createElement(Navigate, { to: "/recommendationrequest" });
+    return React.createElement(Navigate, {});
   }
 
killedBy: RecommendationRequestEditPage tests submit valid changes with PUT and redirects
statusReason: expected "vi.fn()" to be called with arguments: [ { to: '/recommendationrequest' } ]

Received: 

  1st vi.fn() call:

  [
-   {

[Killed] StringLiteral
main/pages/RecommendationRequest/RecommendationRequestEditPage.js:72:20
     null,
     React.createElement(
       "div",
-      { className: "pt-2" },
+      { className: "" },
       React.createElement("h1", null, "Edit RecommendationRequest"),
       recommendationRequest &&
killedBy: RecommendationRequestEditPage tests loads existing record by id and populates form
statusReason: expect(received).toHaveClass()

received value must be an HTMLElement or an SVGElement.
Received has type:  Null
Received has value: null

[Killed] ConditionalExpression
main/pages/RecommendationRequest/RecommendationRequestEditPage.js:74:7
       "div",
       { className: "pt-2" },
       React.createElement("h1", null, "Edit RecommendationRequest"),
-      recommendationRequest &&
-        React.createElement(RecommendationRequestForm, {
-          initialContents: recommendationRequest,
-          submitAction: onSubmit,
-          buttonLabel: "Update",
-        }),
+      true,
     ),
   );
killedBy: RecommendationRequestEditPage tests loads existing record by id and populates form
statusReason: Unable to find an element by: [data-testid="RecommendationRequestForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] LogicalOperator
main/pages/RecommendationRequest/RecommendationRequestEditPage.js:74:7
       "div",
       { className: "pt-2" },
       React.createElement("h1", null, "Edit RecommendationRequest"),
-      recommendationRequest &&
-        React.createElement(RecommendationRequestForm, {
-          initialContents: recommendationRequest,
-          submitAction: onSubmit,
-          buttonLabel: "Update",
-        }),
+      recommendationRequest || React.createElement(RecommendationRequestForm, {
+  initialContents: recommendationRequest,
+  submitAction: onSubmit,
+  buttonLabel: "Update"
+}),
     ),
   );
killedBy: RecommendationRequestEditPage tests renders header but form is not present when backend unavailable
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <input
  class="form-control"
  data-testid="RecommendationRequestForm-requesterEmail"
  id="requesterEmail"
  name="requesterEmail"
  type="email"
