[Killed] StringLiteral
main/components/Articles/ArticlesForm.jsx:129:28
                 required: "Email is required.",
                 pattern: {
                   value: email_regex,
-                  message: "Email must be a valid email address",
+                  message: "",
                 },
               })}
killedBy: ArticlesForm tests Correct Error messages on bad input
statusReason: Unable to find an element with the text: /Email must be a valid email address/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
