[Killed] LogicalOperator
main/components/MenuItemReview/MenuItemReviewForm.jsx:24:10
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
       <Row>
-        {initialContents && (
-          <Col>
-            <Form.Group className="mb-3">
-              <Form.Label htmlFor="id">Id</Form.Label>
-              <Form.Control
-                data-testid={testIdPrefix + "-id"}
-                id="id"
-                type="text"
-                {...register("id")}
-                value={initialContents.id}
-                readOnly
-              />
-            </Form.Group>
-          </Col>
-        )}
+        {initialContents || <Col>
+            <Form.Group className="mb-3">
+              <Form.Label htmlFor="id">Id</Form.Label>
+              <Form.Control data-testid={testIdPrefix + "-id"} id="id" type="text" {...register("id")} value={initialContents.id} readOnly />
+            </Form.Group>
+          </Col>}
 
         <Col>
killedBy: MenuItemReviewForm tests renders correctly
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.jsx:24:10
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
       <Row>
-        {initialContents && (
-          <Col>
-            <Form.Group className="mb-3">
-              <Form.Label htmlFor="id">Id</Form.Label>
-              <Form.Control
-                data-testid={testIdPrefix + "-id"}
-                id="id"
-                type="text"
-                {...register("id")}
-                value={initialContents.id}
-                readOnly
-              />
-            </Form.Group>
-          </Col>
-        )}
+        {false}
 
         <Col>
killedBy: MenuItemReviewForm tests renders correctly with initial contents
statusReason: Unable to find an element by: [data-testid="MenuItemReviewForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.jsx:48:28
               id="itemId"
               type="text"
               isInvalid={Boolean(errors.itemId)}
-              {...register("itemId", { required: "Item Id is required." })}
+              {...register("", { required: "Item Id is required." })}
             />
             <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests renders correctly
statusReason: Cannot read properties of undefined (reading '_f')

[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewForm.jsx:66:45
               id="reviewerEmail"
               type="text"
               isInvalid={Boolean(errors.reviewerEmail)}
-              {...register("reviewerEmail", {
-                required: "Reviewer Email is required.",
-                pattern: {
-                  value: /^[^\s@]+@[^\s@]+\.[^\s@]+$/,
-                  message: "Reviewer Email must be a valid email address",
-                },
-              })}
+              {...register("reviewerEmail", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests Correct error messages on missing input
statusReason: Unable to find an element with the text: /Reviewer Email is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewForm.jsx:68:26
               isInvalid={Boolean(errors.reviewerEmail)}
               {...register("reviewerEmail", {
                 required: "Reviewer Email is required.",
-                pattern: {
-                  value: /^[^\s@]+@[^\s@]+\.[^\s@]+$/,
-                  message: "Reviewer Email must be a valid email address",
-                },
+                pattern: {},
               })}
             />
killedBy: MenuItemReviewForm tests rejects invalid reviewer email
statusReason: Unable to find an element with the text: /Reviewer Email must be a valid email address/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] Regex
main/components/MenuItemReview/MenuItemReviewForm.jsx:69:26
               {...register("reviewerEmail", {
                 required: "Reviewer Email is required.",
                 pattern: {
-                  value: /^[^\s@]+@[^\s@]+\.[^\s@]+$/,
+                  value: /^[^\s@]+@[^\s@]+\.[\s@]+$/,
                   message: "Reviewer Email must be a valid email address",
                 },
killedBy: MenuItemReviewForm tests submits form with valid data
statusReason: expected "vi.fn()" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <form

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.jsx:70:28
                 required: "Reviewer Email is required.",
                 pattern: {
                   value: /^[^\s@]+@[^\s@]+\.[^\s@]+$/,
-                  message: "Reviewer Email must be a valid email address",
+                  message: "",
                 },
               })}
killedBy: MenuItemReviewForm tests rejects invalid reviewer email
statusReason: Unable to find an element with the text: /Reviewer Email must be a valid email address/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
