[Killed] ArrowFunction
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemForm.jsx:21:28
 
   const testIdPrefix = "UCSBDiningCommonsMenuItemForm";
 
-  const stringFieldRules = (label, maxLen = 255) => ({
-    required: `${label} is required.`,
-    maxLength: {
-      value: maxLen,
-      message: `${label} must be at most ${maxLen} characters.`,
-    },
-  });
+  const stringFieldRules = () => undefined;
 
   return (
killedBy: UCSBDiningCommonsMenuItemForm tests Correct error messages on missing input
statusReason: Unable to find an element with the text: /Dining Commons Code is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemForm.jsx:32:10
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
       <Row>
-        {initialContents && (
-          <Col>
-            <Form.Group className="mb-3">
-              <Form.Label htmlFor="id">Id</Form.Label>
-              <Form.Control
-                data-testid={testIdPrefix + "-id"}
-                id="id"
-                type="text"
-                {...register("id")}
-                value={initialContents.id}
-                readOnly
-              />
-            </Form.Group>
-          </Col>
-        )}
+        {true}
       </Row>
 
killedBy: UCSBDiningCommonsMenuItemForm tests renders correctly with initial contents
statusReason: Unable to find an element by: [data-testid="UCSBDiningCommonsMenuItemForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
