[Killed] ArrowFunction
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemTable.jsx:20:35
     navigate(`/diningcommonsmenuitem/edit/${cell.row.original.id}`);
   };
 
-  const cellToAxiosParamsDelete = (cell) => ({
-    url: "/api/ucsbdiningcommonsmenuitem",
-    method: "DELETE",
-    params: {
-      id: cell.row.original.id,
-    },
-  });
+  const cellToAxiosParamsDelete = () => undefined;
 
   const onDeleteSuccess = (message) => {
killedBy: UCSBDiningCommonsMenuItemTable tests Delete button calls delete callback
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <table

[Killed] StringLiteral
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemTable.jsx:21:10
   };
 
   const cellToAxiosParamsDelete = (cell) => ({
-    url: "/api/ucsbdiningcommonsmenuitem",
+    url: "",
     method: "DELETE",
     params: {
killedBy: UCSBDiningCommonsMenuItemTable tests Delete button calls delete callback
statusReason: expected '' to be '/api/ucsbdiningcommonsmenuitem' // Object.is equality
