[Killed] ObjectLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.jsx:63:42
           id="orgTranslation"
           type="text"
           isInvalid={Boolean(errors.orgTranslation)}
-          {...register("orgTranslation", {
-            required: "Full Translation is required.",
-          })}
+          {...register("orgTranslation", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: UCSBOrganizationForm tests Correct Error messsages on missing input
statusReason: Unable to find an element with the text: /Full Translation is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
