[Killed] BlockStatement
main/components/UCSBOrganization/UCSBOrganizationTable.jsx:9:47
 import { toast } from "react-toastify";
 
 // eslint-disable-next-line react-refresh/only-export-components
-export function cellToAxiosParamsDelete(cell) {
-  return {
-    url: "/api/ucsborganization",
-    method: "DELETE",
-    params: {
-      orgCode: cell.row.original.orgCode,
-    },
-  };
-}
+export function cellToAxiosParamsDelete(cell) {}
 
 // eslint-disable-next-line react-refresh/only-export-components
killedBy: UCSBOrganizationTable tests Delete button calls delete callback
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <table

[Killed] BlockStatement
main/components/UCSBOrganization/UCSBOrganizationTable.jsx:39:42
     ["/api/ucsborganization/all"],
   );
   // Stryker restore all
-  const deleteCallback = async (cell) => {
-    deleteMutation.mutate(cell);
-  };
+  const deleteCallback = async (cell) => {};
 
   const columns = [
killedBy: UCSBOrganizationTable tests Delete button calls delete callback
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <table

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.jsx:49:15
       accessorKey: "orgCode",
     },
     {
-      header: "Short Translation",
+      header: "",
       accessorKey: "orgTranslationShort",
     },
killedBy: UCSBOrganizationTable tests Has the expected column headers and content for ordinary user
statusReason: Unable to find an element with the text: Short Translation. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="UCSBOrganizationTable"

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.jsx:54:20
     },
     {
       header: "Full Translation",
-      accessorKey: "orgTranslation",
+      accessorKey: "",
     },
     {
killedBy: UCSBOrganizationTable tests Has the expected column headers and content for ordinary user
statusReason: Unable to find an element by: [data-testid="UCSBOrganizationTable-cell-row-0-col-orgTranslation"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="UCSBOrganizationTable"

[Killed] ObjectLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.jsx:56:5
       header: "Full Translation",
       accessorKey: "orgTranslation",
     },
-    {
-      header: "Inactive",
-      id: "inactive",
-      accessorKey: "inactive",
-      cell: (info) => String(info.getValue()),
-    },
+    {},
   ];
 
killedBy: UCSBOrganizationTable tests Has the expected column headers and content for ordinary user
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.jsx:59:20
     {
       header: "Inactive",
       id: "inactive",
-      accessorKey: "inactive",
+      accessorKey: "",
       cell: (info) => String(info.getValue()),
     },
killedBy: UCSBOrganizationTable tests Has the expected column headers and content for ordinary user
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  false
Received:
  undefined

[Killed] ArrowFunction
main/components/UCSBOrganization/UCSBOrganizationTable.jsx:60:13
       header: "Inactive",
       id: "inactive",
       accessorKey: "inactive",
-      cell: (info) => String(info.getValue()),
+      cell: () => undefined,
     },
   ];
killedBy: UCSBOrganizationTable tests Has the expected column headers and content for ordinary user
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  false
Received:

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.jsx:66:53
 
   if (hasRole(currentUser, "ROLE_ADMIN")) {
     columns.push(
-      ButtonColumn("Edit", "primary", editCallback, "UCSBOrganizationTable"),
+      ButtonColumn("Edit", "primary", editCallback, ""),
     );
     columns.push(
killedBy: UCSBOrganizationTable tests Has the expected column headers and content for adminUser
statusReason: Unable to find an element by: [data-testid="UCSBOrganizationTable-cell-row-0-col-Edit-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="UCSBOrganizationTable"

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.jsx:69:20
       ButtonColumn("Edit", "primary", editCallback, "UCSBOrganizationTable"),
     );
     columns.push(
-      ButtonColumn("Delete", "danger", deleteCallback, "UCSBOrganizationTable"),
+      ButtonColumn("", "danger", deleteCallback, "UCSBOrganizationTable"),
     );
   }
killedBy: UCSBOrganizationTable tests Has the expected column headers and content for adminUser
statusReason: Columns require an id when using a non-string header
