[Killed] ArrowFunction
main/pages/MenuItemReview/MenuItemReviewCreatePage.jsx:8:31
 import { toast } from "react-toastify";
 
 export default function MenuItemReviewCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (review) => ({
-    url: "/api/MenuItemReview/post",
-    method: "POST",
-    params: {
-      itemId: review.itemId,
-      reviewerEmail: review.reviewerEmail,
-      stars: review.stars,
-      dateReviewed: review.dateReviewed,
-      comments: review.comments,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (saved) => {
killedBy: MenuItemReviewCreatePage tests on submit with valid data, posts to backend and navigates to index
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
main/pages/MenuItemReview/MenuItemReviewCreatePage.jsx:9:10
 
 export default function MenuItemReviewCreatePage({ storybook = false }) {
   const objectToAxiosParams = (review) => ({
-    url: "/api/MenuItemReview/post",
+    url: "",
     method: "POST",
     params: {
killedBy: MenuItemReviewCreatePage tests on submit with valid data, posts to backend and navigates to index
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "New MenuItemReview Created - id: 42 itemId: 123",

[Killed] BlockStatement
main/pages/MenuItemReview/MenuItemReviewCreatePage.jsx:20:32
     },
   });
 
-  const onSuccess = (saved) => {
-    toast(
-      `New MenuItemReview Created - id: ${saved.id} itemId: ${saved.itemId}`,
-    );
-  };
+  const onSuccess = (saved) => {};
 
   const mutation = useBackendMutation(
killedBy: MenuItemReviewCreatePage tests on submit with valid data, posts to backend and navigates to index
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0
