[Killed] ObjectLiteral
main/pages/MenuItemReview/MenuItemReviewEditPage.jsx:22:15
       // Stryker disable next-line all : GET is the default, so mutating this to "" doesn't introduce a bug
       method: "GET",
       url: `/api/MenuItemReview`,
-      params: {
-        id,
-      },
+      params: {},
     },
   );
killedBy: MenuItemReviewEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="MenuItemReviewForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrowFunction
main/pages/MenuItemReview/MenuItemReviewEditPage.jsx:28:34
     },
   );
 
-  const objectToAxiosPutParams = (incoming) => ({
-    url: "/api/MenuItemReview",
-    method: "PUT",
-    params: {
-      id: incoming.id,
-    },
-    data: {
-      itemId: incoming.itemId,
-      reviewerEmail: incoming.reviewerEmail,
-      stars: incoming.stars,
-      dateReviewed: incoming.dateReviewed,
-      comments: incoming.comments,
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (saved) => {
killedBy: MenuItemReviewEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "MenuItemReview Updated - id: 17 itemId: 102",

[Killed] StringLiteral
main/pages/MenuItemReview/MenuItemReviewEditPage.jsx:29:10
   );
 
   const objectToAxiosPutParams = (incoming) => ({
-    url: "/api/MenuItemReview",
+    url: "",
     method: "PUT",
     params: {
killedBy: MenuItemReviewEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "MenuItemReview Updated - id: 17 itemId: 102",

[Killed] ObjectLiteral
main/pages/MenuItemReview/MenuItemReviewEditPage.jsx:31:13
   const objectToAxiosPutParams = (incoming) => ({
     url: "/api/MenuItemReview",
     method: "PUT",
-    params: {
-      id: incoming.id,
-    },
+    params: {},
     data: {
       itemId: incoming.itemId,
killedBy: MenuItemReviewEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected {} to deeply equal { id: 17 }

[Killed] BlockStatement
main/pages/MenuItemReview/MenuItemReviewEditPage.jsx:43:32
     },
   });
 
-  const onSuccess = (saved) => {
-    toast(`MenuItemReview Updated - id: ${saved.id} itemId: ${saved.itemId}`);
-  };
+  const onSuccess = (saved) => {};
 
   const mutation = useBackendMutation(
killedBy: MenuItemReviewEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "vi.fn()" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>
