[Killed] StringLiteral
main/pages/MenuItemReview/MenuItemReviewIndexPage.jsx:19:27
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     ["/api/MenuItemReview/all"],
-    { method: "GET", url: "/api/MenuItemReview/all" },
+    { method: "GET", url: "" },
     // Stryker disable next-line all : don't test default value of empty list
     [],
killedBy: MenuItemReviewIndexPage tests renders three reviews correctly for regular user
statusReason: Unable to find an element by: [data-testid="MenuItemReviewTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
