[Killed] BlockStatement
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemCreatePage.jsx:20:32
     },
   });
 
-  const onSuccess = (saved) => {
-    toast(`New UCSBDiningCommonsMenuItem Created - id: ${saved.id}`);
-  };
+  const onSuccess = (saved) => {};
 
   const mutation = useBackendMutation(
killedBy: UCSBDiningCommonsMenuItemCreatePage tests when valid form data is entered and submitted, it posts and redirects
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] StringLiteral
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemCreatePage.jsx:21:11
   });
 
   const onSuccess = (saved) => {
-    toast(`New UCSBDiningCommonsMenuItem Created - id: ${saved.id}`);
+    toast(``);
   };
 
killedBy: UCSBDiningCommonsMenuItemCreatePage tests when valid form data is entered and submitted, it posts and redirects
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "New UCSBDiningCommonsMenuItem Created - id: 17",
