[Killed] BlockStatement
main/pages/UCSBOrganization/UCSBOrganizationCreatePage.jsx:19:39
     },
   });
 
-  const onSuccess = (organization) => {
-    toast(`New organization Created - orgCode: ${organization.orgCode}`);
-  };
+  const onSuccess = (organization) => {};
 
   const mutation = useBackendMutation(
killedBy: UCSBOrganizationCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0
