[Killed] ConditionalExpression
main/pages/UCSBOrganization/UCSBOrganizationEditPage.jsx:66:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit UCSBOrganization</h1>
-        {organization && (
-          <UCSBOrganizationForm
-            initialContents={organization}
-            submitAction={onSubmit}
-            buttonLabel="Update"
-          />
-        )}
+        {false}
       </div>
     </BasicLayout>
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally renders without crashing
statusReason: Unable to find an element by: [data-testid="UCSBOrganizationForm-orgTranslationShort"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] LogicalOperator
main/pages/UCSBOrganization/UCSBOrganizationEditPage.jsx:66:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit UCSBOrganization</h1>
-        {organization && (
-          <UCSBOrganizationForm
-            initialContents={organization}
-            submitAction={onSubmit}
-            buttonLabel="Update"
-          />
-        )}
+        {organization || <UCSBOrganizationForm initialContents={organization} submitAction={onSubmit} buttonLabel="Update" />}
       </div>
     </BasicLayout>
killedBy: UCSBOrganizationEditPage tests when the backend doesn't return data renders header but form is not present
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <input
  class="form-control"
  data-testid="UCSBOrganizationForm-orgCode"
  id="orgCode"
  name="orgCode"
  type="text"
